const l="data:image/svg+xml,%3csvg%20width='32'%20height='32'%20viewBox='0%200%2032%2032'%20fill='none'%20xmlns='http://www.w3.org/2000/svg'%3e%3ccircle%20cx='16'%20cy='16'%20r='15.5'%20fill='%23767676'%20stroke='%23767676'/%3e%3cg%20clip-path='url(%23clip0_3945_4341)'%3e%3cpath%20d='M20.167%207.66675H11.8337C9.53247%207.66675%207.66699%209.53223%207.66699%2011.8334V20.1667C7.66699%2022.4679%209.53247%2024.3334%2011.8337%2024.3334H20.167C22.4682%2024.3334%2024.3337%2022.4679%2024.3337%2020.1667V11.8334C24.3337%209.53223%2022.4682%207.66675%2020.167%207.66675Z'%20stroke='%23F2F2F2'%20stroke-width='1.5'%20stroke-linecap='round'%20stroke-linejoin='round'/%3e%3cpath%20d='M19.3337%2015.475C19.4366%2016.1685%2019.3181%2016.8769%2018.9952%2017.4992C18.6723%2018.1215%2018.1614%2018.6262%2017.5351%2018.9414C16.9088%2019.2566%2016.1991%2019.3663%2015.5069%2019.2549C14.8147%2019.1436%2014.1752%2018.8167%2013.6794%2018.321C13.1837%2017.8252%2012.8569%2017.1857%2012.7455%2016.4935C12.6341%2015.8013%2012.7438%2015.0916%2013.059%2014.4653C13.3742%2013.8391%2013.8789%2013.3281%2014.5012%2013.0052C15.1236%2012.6823%2015.8319%2012.5638%2016.5254%2012.6667C17.2328%2012.7716%2017.8878%2013.1012%2018.3935%2013.6069C18.8992%2014.1126%2019.2288%2014.7676%2019.3337%2015.475Z'%20stroke='%23F2F2F2'%20stroke-width='1.5'%20stroke-linecap='round'%20stroke-linejoin='round'/%3e%3cpath%20d='M20.583%2011.4167H20.5913'%20stroke='%23F2F2F2'%20stroke-width='1.5'%20stroke-linecap='round'%20stroke-linejoin='round'/%3e%3c/g%3e%3cdefs%3e%3cclipPath%20id='clip0_3945_4341'%3e%3crect%20width='20'%20height='20'%20fill='white'%20transform='translate(6%206)'/%3e%3c/clipPath%3e%3c/defs%3e%3c/svg%3e",a="data:image/svg+xml,%3csvg%20width='32'%20height='32'%20viewBox='0%200%2032%2032'%20fill='none'%20xmlns='http://www.w3.org/2000/svg'%3e%3ccircle%20cx='16'%20cy='16'%20r='16'%20fill='%23767676'/%3e%3crect%20width='20'%20height='20'%20transform='translate(5%206)'%20fill='%23767676'/%3e%3cpath%20d='M19.9997%207.66669H17.4997C16.3946%207.66669%2015.3348%208.10567%2014.5534%208.88708C13.772%209.66848%2013.333%2010.7283%2013.333%2011.8334V14.3334H10.833V17.6667H13.333V24.3334H16.6663V17.6667H19.1663L19.9997%2014.3334H16.6663V11.8334C16.6663%2011.6123%2016.7541%2011.4004%2016.9104%2011.2441C17.0667%2011.0878%2017.2787%2011%2017.4997%2011H19.9997V7.66669Z'%20fill='%23F2F2F2'/%3e%3c/svg%3e",s="data:image/svg+xml,%3csvg%20width='32'%20height='32'%20viewBox='0%200%2032%2032'%20fill='none'%20xmlns='http://www.w3.org/2000/svg'%3e%3ccircle%20cx='16'%20cy='16'%20r='16'%20fill='%23767676'/%3e%3cpath%20fill-rule='evenodd'%20clip-rule='evenodd'%20d='M24.199%2010.2994C24.4829%2010.5921%2024.6845%2010.9544%2024.7835%2011.3499C25.0478%2012.8155%2025.1762%2014.3024%2025.1668%2015.7916C25.1721%2017.2585%2025.0438%2018.7229%2024.7835%2020.1666C24.6845%2020.5621%2024.4829%2020.9244%2024.199%2021.2171C23.9152%2021.5097%2023.5591%2021.7223%2023.1668%2021.8333C21.7335%2022.2166%2016.0002%2022.2166%2016.0002%2022.2166C16.0002%2022.2166%2010.2668%2022.2166%208.83348%2021.8333C8.44917%2021.7281%208.09847%2021.5256%207.81527%2021.2453C7.53207%2020.965%207.32595%2020.6165%207.21682%2020.2333C6.95246%2018.7677%206.82413%2017.2808%206.83348%2015.7916C6.82618%2014.3135%206.9545%2012.8379%207.21682%2011.3833C7.31581%2010.9878%207.51741%2010.6254%207.80127%2010.3328C8.08513%2010.0401%208.44119%209.82757%208.83348%209.71659C10.2668%209.33325%2016.0002%209.33325%2016.0002%209.33325C16.0002%209.33325%2021.7335%209.33325%2023.1668%209.68325C23.5591%209.79424%2023.9152%2010.0068%2024.199%2010.2994ZM18.9168%2015.7917L14.1251%2018.5167V13.0667L18.9168%2015.7917Z'%20fill='%23F2F2F2'/%3e%3c/svg%3e";class r{constructor(e){this.$target=e,this.render()}render(){const e=`
      <div class="footer-inner">
        <div class="footer-top">
          <ul class="footer-nav">
            <li><a href="#">호두샵 소개</a></li>
            <li><span class="divider">|</span></li>
            <li><a href="#">이용약관</a></li>
            <li><span class="divider">|</span></li>
            <li><a href="#" class="bold">개인정보처리방침</a></li>
            <li><span class="divider">|</span></li>
            <li><a href="#">전자금융거래약관</a></li>
            <li><span class="divider">|</span></li>
            <li><a href="#">청소년보호정책</a></li>
            <li><span class="divider">|</span></li>
            <li><a href="#">제휴문의</a></li>
          </ul>
          
          <div class="footer-sns">
            <a href="#" aria-label="Instagram">
              <img src="${l}" alt="Instagram" />
            </a>
            <a href="#" aria-label="Facebook">
              <img src="${a}" alt="Facebook" />
            </a>
            <a href="#" aria-label="Youtube">
              <img src="${s}" alt="Youtube" />
            </a>
          </div>
        </div>

        <div class="footer-line"></div>

        <div class="footer-bottom">
          <strong class="company-name">(주)HODU SHOP</strong>
          <address class="company-info">
            제주특별자치도 제주시 동광고 137 제주코딩베이스캠프<br />
            사업자 번호 : 000-0000-0000 | 통신판매업<br />
            대표 : 김호두
          </address>
        </div>
      </div>
    `,i=document.createElement("footer");i.className="footer",i.innerHTML=e,this.$target.appendChild(i)}}export{r as F};
